import './App.css';
import CarComponent from "./components/car.component";

function App() {
    return (
        <div>
            <CarComponent
                model={'skoda'}
                description={'superB'}
                power={140}
                volume={2}
                image={'https://www.avtoavenu.ru/wp-content/uploads/Skoda-Superb-2_2.jpg'}
                text={"Лінійка бензинових двигунів спочатку складалася з шести моторів концерну Volkswagen:" +
                " двох 4-циліндрових турбованих бензинових TSI: об'ємом 1,4 літра (потужністю 125 л. С.)" +
                " І 1,8-літра (потужністю 152 л. С. Або 160 л. С . на різних ринках)," +
                " плюс флагманський атмосферне VR6 обсягом 3,6 літра і потужністю 260 л. с.," +
                " який агрегатувався тільки з повним приводом і 6-ступінчастою роботизованою трансмісією DSG ru en ." +
                " Ряд дизельних двигунів складався з трьох турбированних варіантів:" +
                " 1,9-літрового потужністю 105 л. с. і двох 2-літрових потужністю 140 л. с. або 170 л. с." +
                " У 2010 році лінійка двигунів була оновлена." +
                " Став доступний 2-літровий бензиновий мотор TSI потужністю 200 л. с."}/>

            <CarComponent
                model={'ford'}
                description={'focus'}
                power={180}
                volume={2}
                image={'https://carexpert.ru/img/foto600/ford/fordf615.jpg'}
                text={"Focus нового, четвертого, покоління (внутрішнє позначення C519)" +
                " був офіційно представлений 10 квітня 2018 р [37] . Автомобіль проектувався німецьким підрозділом компанії Ford," +
                " має три варіанти кузова - седан, «універсал» і 5-дв. хетчбек, і базується на повністю новій платформі C2." +
                " Вперше на Focus стали доступні панорамний дах, повністю світлодіодні фари, Head Up Display," +
                " А також обертається джойстік- «шайба» перемикання передач для 8-ступінчастою АКПП. Крім того," +
                " автомобіль отримав збільшену на 53 мм колісну базу, що позитивно відбилося на внутрішньому обсязі." +
                " Вперше, версії в кузовах хетчбек і седан, оснащені моторами початкового рівня потужності," +
                " замість задньої підвіски багатоважеля будуть комплектуватися пружною балкою." +
                " В кінці 2018 року стане доступний для замовлення автомобіль в комплектації Active," +
                " що має збільшений на 30 мм дорожній просвіт, а також володіє іншими ознаками спрощеного кросовера." +
                " Компанія Ford також вирішила відмовитися в Європі від комплектації Ambiente," +
                " a в США на 92% будуть скорочені комбінації доступного до вибору оснащення." +
                " Для покупців у Європі буде доступна більш «люксова» комплектація Vignale." +
                " Поява в другій половині 2019 року версії ST підтверджено компанією Ford."}/>

            <CarComponent
                model={'bmw'}
                description={'gt530'}
                power={340}
                volume={3}
                image={'https://carexpert.ru/img/foto600/bmw/bmw5252.jpg'}
                text={"BMW 5 Series Gran Turismo (внутрішньофірмовий індекс F07 )" +
                " - задньопривідний або повнопривідний п'ятимісний спортивний автомобіль бізнес-класу" +
                " з 5-й задніми дверима (нім. «Флісхек», англ. «Ліфтбек»). Перший в даному класі автомобіль." +
                " Побудований на технічній базі моделей BMW 7-й і 5-й серій." +
                " Прем'єра серійного BMW 5 Серії GT відбулася в 2009 році на автосалоні в Женеві."}/>


        </div>
    );
}

export default App;
